---
kind: property
id: P:Autodesk.Revit.DB.ConnectorSet.Size
source: html/802b9f2d-20cb-86b9-a36e-422bdaf04015.htm
---
# Autodesk.Revit.DB.ConnectorSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```